{
    "content": [
        {
            "cartoon": "/bayOfPigsCartoon.jpg",
            "text": "This political cartoon is pointing out the absurdity of the CIA's belief that Cubans would rise up against Castro upon seeing Cuban expats attack. What actually ended up happening, and what this cartoon is showing, is that Castro was able to turn the US' failure into a propaganda win by making his people believe that America was attacking all Cubans, not just Castro's government."
        },
        {
            "title": "CIA failed at the Bay of Pigs (Cuba)",
            "text": "The CIA trained a small force of Cuban expats to invade Cuba and take down the Castro Regime under the assumption that Cuban citizens would rise up the second they say the expats arrive. The Invasion was initiated in the spring of 1961 but without U.S. military assistance, the invasion crumbled. The reputation of the Agency and the US suffered significantly."
        },
        {
            "title": "Secretary of Defense McNamara created the Defense Intelligence Agency (DIA)",
            "text": "DIA was created to try to centralize US intelligence following the embarassment that was the Bay of Pigs."
        },
        {
            "title": "Cuban Missile Crisis",
            "text": "In response to the Soviets moving nuclear weapons into Cuba, John F Kennedy ordered the blockade of Cuba and entered a political standoff with the Soviet Union, putting the world unbelievably close to nuclear war. The conflict ended when America agreed to remove nuclear weapons from turkey."
        },
        {
            "title": "DCI separated from the CIA",
            "text": "In July 1961, the President's Foreign Intelligence Advisory Board proposed the DCI be separated from the CIA. President Kennedy did not endorse the recommendation."
        },
        {
            "title": "DCI unable to regain control",
            "text": "The attention that Communist expansion in Laos, the Vietnam War and conflicts in the Middle East required, prevented serious efforts by the DCI to assert greater control over the Intelligence Community."
        }
    ]
}