{
    "content": [
        {
            "title": "A new President",
            "text": "During Reagan's 1980 presidential election, intelligence became one of his targeted campaign issues. The Republican Party said that the Democrats had impaired the efficiency of the Intelligence Community and underestimated the strength of the Soviet's military. President Reagan came into office promising to improve intelligence capabilities by upgrading technical systems and strengthening counterintelligence. Goingforth Intelligence budgets were increased, and new personnel were hired."
        },
        {
            "title": "Reagan's Executive Order",
            "text": "On 4 December 1981, going into one year into his administration, President Reagan issued an Executive Order on intelligence (E.O. 12333). The Executive Order reaffirmed the function of an intelligence agency and continued its prior restrictions, but it set a more positive tone than its predecessor. It basically  gave the CIA greater latitude to gather foreign intelligence within the United States and to provide assistance to law enforcement."
        },
        {
            "title": "Information leak with US embassy in Moscow",
            "text": "The Walker-Whitworth, Pelton, and Howard cases dealt serious hits on U.S. intelligence. As the year came to an end, a Marine guard in the U.S. The Embassy in Moscow confessed to having passed information to the Soviets. He was charged for allowing Soviet personnel to enter the chancery building. It was further disclosed that the U.S. had determined its new chancery in Moscow had been thoroughly bugged during its construction. Coming in close succession, these disclosures shocked the public and the world."
        },
        {
            "title": "Iran-Contra Affair",
            "text": "In November 1986, Congress learned that representatives of the Reagan Administration were selling arms to the Government of Iran in return for its assistance in securing the release of U.S. hostages held in Lebanon Congress."
        }
    ]
}