{
    "content": [
        {  
            "title": "Intelligence Authorization Act for Fiscal Year 2000",
            "text": "Intelligence activities authorizes appropriations for FY 2000. Conducts intelligence for Central Intelligence Agency (CIA), Department of Defense,  Defense Intelligence Agency, National Security Agency, Departments of the Army, Navy, and Air Force, Departments of State, the Treasury, and Energy, Federal Bureau of Investigation (FBI), National Reconnaissance Office (NRO), and National Imagery and Mapping Agency."
        },
        {   
            "title": "International Narcotics Trafficking - Foreign Narcotics Kingpin Designation Act",
            "text": "Directs the Secretary of the Treasury also includes the AG, the Secretary of Defense, the Secretary of State, and the DCI consults and provides information to enable the President to submit annually to specified congressional committees a report Identifies the foreign people appropriate for sanctions. Publicly details the President's intent to impose sanctions upon such significant foreign narcotics traffickers"
        },
        {
            "title": "National Commission For the Review of the National Reconnaissance Office",
            "text": "Reports the National commission for the Review of the national reconnaissance office and reports the independent commission on the national imagery and mapping agency."
        },
        {
            "title": "Central Intelligence Agency Retirement and Disability System",
            "text": "Authorized appropriations for FY 2000 for the Central Intelligence Agency Retirement and Disability Fund."
        },
        {
            "title": "Foreign Counterintelligence and International Terrorism Investigations",
            "text": "Amended the Foreign Intelligence Surveillance Act of 1978 to include within the definition of \"agent of a foreign power\" for purposes of coverage under such Act a person who knowingly enters the United States under a false or fraudulent identity for or on behalf of a foreign power or, while in the United States, knowingly assumes a false or fraudulent identity for or on behalf of a foreign power."
        },
        {
            "title": "Protect America Act of 2007",
            "text": "amended the Foreign Intelligence Surveillance Act of 1978 to provide additional procedures for authorizing certain acquisitions of foreign intelligence information and for other purposes."
        },
        {
            "title": "Intelligence Reform and Terrorism Prevention Act of 2004",
            "text": "To reform the intelligence community and the intelligence and intelligence-related activities of the United States Government, and for other purposes. "
        }
    ]
}